zuyih/platform-ststm32/misc/svd/STM32U385.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DLYBSD1</name>
      <description>DLYB Address block</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x420C8400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DLYB_CR</name>
          <displayName>DLYB_CR</displayName>
          <description>DLYB control register </description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEN</name>
              <description>
0: DLYB disabled.
1: DLYB enabled.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>DLYB disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>DLYB enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEN</name>
              <description>
0: Sampler length and register access to UNIT[6:0] and SEL[3:0] disabled, output clock enabled.
1: Sampler length and register access to UNIT[6:0] and SEL[3:0] enabled, output clock disabled.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Sampler length and register access to UNIT[6:0] and SEL[3:0] disabled, output clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Sampler length and register access to UNIT[6:0] and SEL[3:0] enabled, output clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYB_CFGR</name>
          <displayName>DLYB_CFGR</displayName>
          <description>DLYB configuration register </description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>These bits can only be written when SEN = 1. 
Output clock phase = input clock + SEL[3:0] x unit delay
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNIT</name>
              <description>These bits can only be written when SEN = 1.
Unit delay = initial delay + UNIT[6:0] x delay step
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNG</name>
              <description>These bits reflect the 12 unit delay values sampled at the rising edge of the input clock.
The value is only valid when LNGF = 1.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LNGF</name>
              <description>This flag indicates when the delay line length value contained in LNG[11:0] is valid after UNIT[6:0] bits changed.
0: Length value in LNG is not valid.
1: Length value in LNG is valid.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Length value in LNG is not valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Length value in LNG is valid.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="DLYBSD1">
      <name>SEC_DLYBSD1</name>
      <baseAddress>0x520C8400</baseAddress>
    </peripheral>
	<peripheral derivedFrom="DLYBSD1">
      <name>DLYBOS1</name>
      <baseAddress>0x420CF000</baseAddress>
    </peripheral>
	<peripheral derivedFrom="DLYBSD1">
      <name>SEC_DLYBOS1</name>
      <baseAddress>0x520CF000</baseAddress>
    </peripheral>
    <peripheral>
      <name>ExTI</name>
      <description>ExTI address block description</description>
      <groupName>ExTI</groupName>
      <baseAddress>0x40032000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x88</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD_PVM</name>
        <description>Programmable voltage detector/peripheral voltage monitor-ExTI16/19/20/21/22</description>
        <value>001</value>
      </interrupt>
      <interrupt>
        <name>ExTI0</name>
        <description>ExTI line0 interrupt</description>
        <value>011</value>
      </interrupt>
      <interrupt>
        <name>ExTI1</name>
        <description>ExTI line1 interrupt</description>
        <value>012</value>
      </interrupt>
      <interrupt>
        <name>ExTI2</name>
        <description>ExTI line2 interrupt</description>
        <value>013</value>
      </interrupt>
      <interrupt>
        <name>ExTI3</name>
        <description>ExTI line3 interrupt</description>
        <value>014</value>
      </interrupt>
      <interrupt>
        <name>ExTI4</name>
        <description>ExTI line4 interrupt</description>
        <value>015</value>
      </interrupt>
      <interrupt>
        <name>ExTI5</name>
        <description>ExTI line5 interrupt</description>
        <value>016</value>
      </interrupt>
      <interrupt>
        <name>ExTI6</name>
        <description>ExTI line6 interrupt</description>
        <value>017</value>
      </interrupt>
      <interrupt>
        <name>ExTI7</name>
        <description>ExTI line7 interrupt</description>
        <value>018</value>
      </interrupt>
      <interrupt>
        <name>ExTI8</name>
        <description>ExTI line8 interrupt</description>
        <value>019</value>
      </interrupt>
      <interrupt>
        <name>ExTI9</name>
        <description>ExTI line9 interrupt</description>
        <value>020</value>
      </interrupt>
      <interrupt>
        <name>ExTI10</name>
        <description>ExTI line10 interrupt</description>
        <value>021</value>
      </interrupt>
      <interrupt>
        <name>ExTI11</name>
        <description>ExTI line11 interrupt</description>
        <value>022</value>
      </interrupt>
      <interrupt>
        <name>ExTI12</name>
        <description>ExTI line12 interrupt</description>
        <value>023</value>
      </interrupt>
      <interrupt>
        <name>ExTI13</name>
        <description>ExTI line13 interrupt</description>
        <value>024</value>
      </interrupt>
      <interrupt>
        <name>ExTI14</name>
        <description>ExTI line14 interrupt</description>
        <value>025</value>
      </interrupt>
      <interrupt>
        <name>ExTI15</name>
        <description>ExTI line15 interrupt</description>
        <value>026</value>
      </interrupt>
      <interrupt>
        <name>FPU</name>
        <description>Floating point interrupt</description>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>COMP</name>
        <description>COMP1/COMP2</description>
        <value>72</value>
      </interrupt>
      <registers>
        <register>
          <name>ExTI_RTSR1</name>
          <displayName>ExTI_RTSR1</displayName>
          <description>ExTI rising trigger selection register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RT0</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT2</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT3</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT4</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT5</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT6</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT7</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT8</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT9</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT10</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT11</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT12</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT13</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT14</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT15</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT16</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Rising trigger disabled (for event and interrupt) for input line</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Rising trigger enabled (for event and interrupt) for input line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT17</name>
              <description>Rising trigger event configuration bit of configurable event input i
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
