zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>ExTI_ExTICR2</name>
          <displayName>ExTI_ExTICR2</displayName>
          <description>ExTI external interrupt selection register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ExTI4</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI5</name>
              <description>None</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI6</name>
              <description>ExTI6 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[6] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[6] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[6] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[6] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[6] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[6] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[6] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ExTI7</name>
              <description>ExTI7 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[7] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[7] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[7] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[7] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[7] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[7] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[7] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ExTI_ExTICR3</name>
          <displayName>ExTI_ExTICR3</displayName>
          <description>ExTI external interrupt selection register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ExTI8</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI9</name>
              <description>None</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI10</name>
              <description>ExTI10 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[10] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[10] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[10] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[10] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[10] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[10] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[10] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ExTI11</name>
              <description>ExTI11 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[11] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[11] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[11] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[11] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[11] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[11] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[11] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ExTI_ExTICR4</name>
          <displayName>ExTI_ExTICR4</displayName>
          <description>ExTI external interrupt selection register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ExTI12</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI13</name>
              <description>None</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ExTI14</name>
              <description>ExTI14 GPIO port selection
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[14] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[14] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[14] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[14] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[14] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[14] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[14] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ExTI15</name>
              <description>ExTI15 GPIO port selection
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x00</name>
                  <description>PA[15] pin</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x01</name>
                  <description>PB[15] pin</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x02</name>
                  <description>PC[15] pin</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x03</name>
                  <description>PD[15] pin</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x04</name>
                  <description>PE[15] pin</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x06</name>
                  <description>PG[15] pin</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x07</name>
                  <description>PH[15] pin</description>
                  <value>0x07</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ExTI_LOCKR</name>
          <displayName>ExTI_LOCKR</displayName>
          <description>ExTI lock register</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Global security and privilege configuration registers (ExTI_SECCFGR and ExTI_PRIVCFGR) lock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Security and privilege configuration open, can be modified.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Security and privilege configuration locked, can no longer be modified.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
