zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>GPDMA_RCFGLOCKR</name>
          <displayName>GPDMA_RCFGLOCKR</displayName>
          <description>GPDMA configuration lock register </description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK0</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 0 is writable.
1: secure privilege configuration of the channel 0 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 0 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 0 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK1</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 1 is writable.
1: secure privilege configuration of the channel 1 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 1 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 1 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK2</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 2 is writable.
1: secure privilege configuration of the channel 2 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 2 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 2 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK3</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 3 is writable.
1: secure privilege configuration of the channel 3 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 3 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 3 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK4</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 4 is writable.
1: secure privilege configuration of the channel 4 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 4 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 4 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK5</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 5 is writable.
1: secure privilege configuration of the channel 5 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 5 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 5 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK6</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 6 is writable.
1: secure privilege configuration of the channel 6 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 6 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 6 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK7</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 7 is writable.
1: secure privilege configuration of the channel 7 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 7 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 7 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK8</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 8 is writable.
1: secure privilege configuration of the channel 8 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 8 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 8 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK9</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 9 is writable.
1: secure privilege configuration of the channel 9 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 9 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 9 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK10</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 10 is writable.
1: secure privilege configuration of the channel 10 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 10 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 10 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK11</name>
              <description>This bit is cleared after reset and, once set, it cannot be reset until a global GPDMA reset.
0: secure privilege configuration of the channel 11 is writable.
1: secure privilege configuration of the channel 11 is not writable.
Note: If TZEN = 0, this register can be written by a privileged access with any secure/non-secure attribute.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>secure privilege configuration of the channel 11 is writable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>secure privilege configuration of the channel 11 is not writable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
