zuyih/platform-ststm32/misc/svd/STM32U385.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC1_TZIC">
      <name>SEC_GTZC1_TZIC</name>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
    <peripheral>
      <name>GTZC1_MPCBB1</name>
      <description>GTZC1_MPCBB1 Address block</description>
      <groupName>GTZC</groupName>
      <baseAddress>0x40032C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTZC1_MPCBB1_CR</name>
          <displayName>GTZC1_MPCBB1_CR</displayName>
          <description>GTZC1 SRAM1 MPCBB control register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GLOCK</name>
              <description>This bit is cleared by default and once set, it can not be reset until system reset.
0: control register not locked
1: control register locked
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>control register not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>control register locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVSECSTATE</name>
              <description>This bit is used to define the internal SRAMs clocks control in RCC as secure or not.
0: SRAMs clocks are secure if a secure area exists in the MPCBB. It is non secure if there is no secure area.
1: SRAMs clocks are non-secure even if a secure area exists in the MPCBB, and secure even if no secure block is set in the MPCBB. 
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAMs clocks are secure if a secure area exists in the MPCBB. It is non secure if there is no secure area.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAMs clocks are non-secure even if a secure area exists in the MPCBB, and secure even if no secure block is set in the MPCBB.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRWILADIS</name>
              <description>This bit disables the detection of an illegal access when a secure read/write transaction access a non-secure blocks of the block-based SRAM (secure fetch on non-secure block is always considered illegal).
0: enabled, secure read/write access not allowed on non-secure SRAM block
1: disabled, secure read/write access allowed on non-secure SRAM block
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>enabled, secure read/write access not allowed on non-secure SRAM block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>disabled, secure read/write access allowed on non-secure SRAM block</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTZC1_MPCBB1_CFGLOCKR1</name>
          <displayName>GTZC1_MPCBB1_CFGLOCKR1</displayName>
          <description>GTZC1 SRAM1 MPCBB configuration lock register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPLCK0</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR0 and GTZC1_MPCBB1_PRIVCFGR0 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR0 and GTZC1_MPCBB1_PRIVCFGR0 are ignored
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR0 and GTZC1_MPCBB1_PRIVCFGR0 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR0 and GTZC1_MPCBB1_PRIVCFGR0 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK1</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR1 and GTZC1_MPCBB1_PRIVCFGR1 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR1 and GTZC1_MPCBB1_PRIVCFGR1 are ignored
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR1 and GTZC1_MPCBB1_PRIVCFGR1 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR1 and GTZC1_MPCBB1_PRIVCFGR1 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK2</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR2 and GTZC1_MPCBB1_PRIVCFGR2 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR2 and GTZC1_MPCBB1_PRIVCFGR2 are ignored
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR2 and GTZC1_MPCBB1_PRIVCFGR2 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR2 and GTZC1_MPCBB1_PRIVCFGR2 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK3</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR3 and GTZC1_MPCBB1_PRIVCFGR3 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR3 and GTZC1_MPCBB1_PRIVCFGR3 are ignored
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR3 and GTZC1_MPCBB1_PRIVCFGR3 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR3 and GTZC1_MPCBB1_PRIVCFGR3 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK4</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR4 and GTZC1_MPCBB1_PRIVCFGR4 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR4 and GTZC1_MPCBB1_PRIVCFGR4 are ignored
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR4 and GTZC1_MPCBB1_PRIVCFGR4 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR4 and GTZC1_MPCBB1_PRIVCFGR4 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK5</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR5 and GTZC1_MPCBB1_PRIVCFGR5 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR5 and GTZC1_MPCBB1_PRIVCFGR5 are ignored
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR5 and GTZC1_MPCBB1_PRIVCFGR5 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR5 and GTZC1_MPCBB1_PRIVCFGR5 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK6</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR6 and GTZC1_MPCBB1_PRIVCFGR6 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR6 and GTZC1_MPCBB1_PRIVCFGR6 are ignored
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR6 and GTZC1_MPCBB1_PRIVCFGR6 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR6 and GTZC1_MPCBB1_PRIVCFGR6 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK7</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR7 and GTZC1_MPCBB1_PRIVCFGR7 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR7 and GTZC1_MPCBB1_PRIVCFGR7 are ignored
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR7 and GTZC1_MPCBB1_PRIVCFGR7 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR7 and GTZC1_MPCBB1_PRIVCFGR7 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK8</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR8 and GTZC1_MPCBB1_PRIVCFGR8 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR8 and GTZC1_MPCBB1_PRIVCFGR8 are ignored
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR8 and GTZC1_MPCBB1_PRIVCFGR8 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR8 and GTZC1_MPCBB1_PRIVCFGR8 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK9</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR9 and GTZC1_MPCBB1_PRIVCFGR9 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR9 and GTZC1_MPCBB1_PRIVCFGR9 are ignored
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR9 and GTZC1_MPCBB1_PRIVCFGR9 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR9 and GTZC1_MPCBB1_PRIVCFGR9 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK10</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR10 and GTZC1_MPCBB1_PRIVCFGR10 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR10 and GTZC1_MPCBB1_PRIVCFGR10 are ignored
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR10 and GTZC1_MPCBB1_PRIVCFGR10 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR10 and GTZC1_MPCBB1_PRIVCFGR10 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK11</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR11 and GTZC1_MPCBB1_PRIVCFGR11 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR11 and GTZC1_MPCBB1_PRIVCFGR11 are ignored
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR11 and GTZC1_MPCBB1_PRIVCFGR11 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR11 and GTZC1_MPCBB1_PRIVCFGR11 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK12</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR12 and GTZC1_MPCBB1_PRIVCFGR12 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR12 and GTZC1_MPCBB1_PRIVCFGR12 are ignored
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR12 and GTZC1_MPCBB1_PRIVCFGR12 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR12 and GTZC1_MPCBB1_PRIVCFGR12 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK13</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR13 and GTZC1_MPCBB1_PRIVCFGR13 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR13 and GTZC1_MPCBB1_PRIVCFGR13 are ignored
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR13 and GTZC1_MPCBB1_PRIVCFGR13 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR13 and GTZC1_MPCBB1_PRIVCFGR13 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK14</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR14 and GTZC1_MPCBB1_PRIVCFGR14 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR14 and GTZC1_MPCBB1_PRIVCFGR14 are ignored
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR14 and GTZC1_MPCBB1_PRIVCFGR14 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR14 and GTZC1_MPCBB1_PRIVCFGR14 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK15</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR15 and GTZC1_MPCBB1_PRIVCFGR15 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR15 and GTZC1_MPCBB1_PRIVCFGR15 are ignored
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR15 and GTZC1_MPCBB1_PRIVCFGR15 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR15 and GTZC1_MPCBB1_PRIVCFGR15 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK16</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR16 and GTZC1_MPCBB1_PRIVCFGR16 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR16 and GTZC1_MPCBB1_PRIVCFGR16 are ignored
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR16 and GTZC1_MPCBB1_PRIVCFGR16 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR16 and GTZC1_MPCBB1_PRIVCFGR16 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK17</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR17 and GTZC1_MPCBB1_PRIVCFGR17 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR17 and GTZC1_MPCBB1_PRIVCFGR17 are ignored
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR17 and GTZC1_MPCBB1_PRIVCFGR17 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR17 and GTZC1_MPCBB1_PRIVCFGR17 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK18</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR18 and GTZC1_MPCBB1_PRIVCFGR18 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR18 and GTZC1_MPCBB1_PRIVCFGR18 are ignored
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR18 and GTZC1_MPCBB1_PRIVCFGR18 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR18 and GTZC1_MPCBB1_PRIVCFGR18 are ignored</description>
                  <value>1</value>
