zuyih/platform-ststm32/misc/svd/STM32U385.svd
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK19</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR19 and GTZC1_MPCBB1_PRIVCFGR19 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR19 and GTZC1_MPCBB1_PRIVCFGR19 are ignored
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR19 and GTZC1_MPCBB1_PRIVCFGR19 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR19 and GTZC1_MPCBB1_PRIVCFGR19 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK20</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR20 and GTZC1_MPCBB1_PRIVCFGR20 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR20 and GTZC1_MPCBB1_PRIVCFGR20 are ignored
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR20 and GTZC1_MPCBB1_PRIVCFGR20 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR20 and GTZC1_MPCBB1_PRIVCFGR20 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK21</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR21 and GTZC1_MPCBB1_PRIVCFGR21 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR21 and GTZC1_MPCBB1_PRIVCFGR21 are ignored
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR21 and GTZC1_MPCBB1_PRIVCFGR21 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR21 and GTZC1_MPCBB1_PRIVCFGR21 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK22</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR22 and GTZC1_MPCBB1_PRIVCFGR22 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR22 and GTZC1_MPCBB1_PRIVCFGR22 are ignored
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR22 and GTZC1_MPCBB1_PRIVCFGR22 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR22 and GTZC1_MPCBB1_PRIVCFGR22 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK23</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR23 and GTZC1_MPCBB1_PRIVCFGR23 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR23 and GTZC1_MPCBB1_PRIVCFGR23 are ignored
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR23 and GTZC1_MPCBB1_PRIVCFGR23 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR23 and GTZC1_MPCBB1_PRIVCFGR23 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK24</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR24 and GTZC1_MPCBB1_PRIVCFGR24 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR24 and GTZC1_MPCBB1_PRIVCFGR24 are ignored
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR24 and GTZC1_MPCBB1_PRIVCFGR24 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR24 and GTZC1_MPCBB1_PRIVCFGR24 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK25</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR25 and GTZC1_MPCBB1_PRIVCFGR25 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR25 and GTZC1_MPCBB1_PRIVCFGR25 are ignored
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR25 and GTZC1_MPCBB1_PRIVCFGR25 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR25 and GTZC1_MPCBB1_PRIVCFGR25 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK26</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR26 and GTZC1_MPCBB1_PRIVCFGR26 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR26 and GTZC1_MPCBB1_PRIVCFGR26 are ignored
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR26 and GTZC1_MPCBB1_PRIVCFGR26 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR26 and GTZC1_MPCBB1_PRIVCFGR26 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK27</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR27 and GTZC1_MPCBB1_PRIVCFGR27 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR27 and GTZC1_MPCBB1_PRIVCFGR27 are ignored
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR27 and GTZC1_MPCBB1_PRIVCFGR27 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR27 and GTZC1_MPCBB1_PRIVCFGR27 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK28</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR28 and GTZC1_MPCBB1_PRIVCFGR28 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR28 and GTZC1_MPCBB1_PRIVCFGR28 are ignored
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR28 and GTZC1_MPCBB1_PRIVCFGR28 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR28 and GTZC1_MPCBB1_PRIVCFGR28 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK29</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR29 and GTZC1_MPCBB1_PRIVCFGR29 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR29 and GTZC1_MPCBB1_PRIVCFGR29 are ignored
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR29 and GTZC1_MPCBB1_PRIVCFGR29 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR29 and GTZC1_MPCBB1_PRIVCFGR29 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK30</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR30 and GTZC1_MPCBB1_PRIVCFGR30 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR30 and GTZC1_MPCBB1_PRIVCFGR30 are ignored
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR30 and GTZC1_MPCBB1_PRIVCFGR30 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR30 and GTZC1_MPCBB1_PRIVCFGR30 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLCK31</name>
              <description>This bit is set by software and can be cleared only by system reset.
0: GTZC1_MPCBB1_SECCFGR31 and GTZC1_MPCBB1_PRIVCFGR31 can be written.
1: Writes to GTZC1_MPCBB1_SECCFGR31 and GTZC1_MPCBB1_PRIVCFGR31 are ignored
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>GTZC1_MPCBB1_SECCFGR31 and GTZC1_MPCBB1_PRIVCFGR31 can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Writes to GTZC1_MPCBB1_SECCFGR31 and GTZC1_MPCBB1_PRIVCFGR31 are ignored</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
