zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>GTZC1_MPCBB1_SECCFGR13</name>
          <displayName>GTZC1_MPCBB1_SECCFGR13</displayName>
          <description>GTZC1 SRAM1 MPCBB security configuration for super-block 13 register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC0</name>
              <description>Unprivileged write to this bit is ignored if PRIV0 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 0, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 0, belonging to super-block 13.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 0, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 0, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC1</name>
              <description>Unprivileged write to this bit is ignored if PRIV1 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 1, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 1, belonging to super-block 13.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 1, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 1, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC2</name>
              <description>Unprivileged write to this bit is ignored if PRIV2 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 2, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 2, belonging to super-block 13.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 2, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 2, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC3</name>
              <description>Unprivileged write to this bit is ignored if PRIV3 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 3, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 3, belonging to super-block 13.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 3, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 3, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC4</name>
              <description>Unprivileged write to this bit is ignored if PRIV4 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 4, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 4, belonging to super-block 13.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 4, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 4, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC5</name>
              <description>Unprivileged write to this bit is ignored if PRIV5 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 5, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 5, belonging to super-block 13.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 5, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 5, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC6</name>
              <description>Unprivileged write to this bit is ignored if PRIV6 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 6, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 6, belonging to super-block 13.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 6, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 6, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC7</name>
              <description>Unprivileged write to this bit is ignored if PRIV7 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 7, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 7, belonging to super-block 13.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 7, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 7, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC8</name>
              <description>Unprivileged write to this bit is ignored if PRIV8 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 8, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 8, belonging to super-block 13.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 8, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 8, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC9</name>
              <description>Unprivileged write to this bit is ignored if PRIV9 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 9, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 9, belonging to super-block 13.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 9, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 9, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC10</name>
              <description>Unprivileged write to this bit is ignored if PRIV10 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 10, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 10, belonging to super-block 13.
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 10, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 10, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC11</name>
              <description>Unprivileged write to this bit is ignored if PRIV11 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 11, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 11, belonging to super-block 13.
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 11, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 11, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC12</name>
              <description>Unprivileged write to this bit is ignored if PRIV12 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 12, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 12, belonging to super-block 13.
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 12, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 12, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC13</name>
              <description>Unprivileged write to this bit is ignored if PRIV13 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 13, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 13, belonging to super-block 13.
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 13, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 13, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC14</name>
              <description>Unprivileged write to this bit is ignored if PRIV14 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 14, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 14, belonging to super-block 13.
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 14, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 14, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC15</name>
              <description>Unprivileged write to this bit is ignored if PRIV15 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 15, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 15, belonging to super-block 13.
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 15, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 15, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC16</name>
              <description>Unprivileged write to this bit is ignored if PRIV16 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 16, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 16, belonging to super-block 13.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 16, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 16, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC17</name>
              <description>Unprivileged write to this bit is ignored if PRIV17 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 17, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 17, belonging to super-block 13.
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 17, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 17, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC18</name>
              <description>Unprivileged write to this bit is ignored if PRIV18 bit is set in GTZC1_MPCBB1_PRIVCFGR13.
Writes are ignored if SPLCK13 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 18, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 18, belonging to super-block 13.
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 18, belonging to super-block 13. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 18, belonging to super-block 13.</description>
                  <value>1</value>
                </enumeratedValue>
