zuyih/platform-ststm32/misc/svd/STM32U385.svd
              </enumeratedValues>
            </field>
            <field>
              <name>SEC19</name>
              <description>Unprivileged write to this bit is ignored if PRIV19 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 19, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 19, belonging to super-block 26.
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 19, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 19, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC20</name>
              <description>Unprivileged write to this bit is ignored if PRIV20 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 20, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 20, belonging to super-block 26.
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 20, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 20, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC21</name>
              <description>Unprivileged write to this bit is ignored if PRIV21 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 21, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 21, belonging to super-block 26.
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 21, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 21, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC22</name>
              <description>Unprivileged write to this bit is ignored if PRIV22 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 22, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 22, belonging to super-block 26.
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 22, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 22, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC23</name>
              <description>Unprivileged write to this bit is ignored if PRIV23 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 23, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 23, belonging to super-block 26.
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 23, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 23, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC24</name>
              <description>Unprivileged write to this bit is ignored if PRIV24 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 24, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 24, belonging to super-block 26.
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 24, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 24, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC25</name>
              <description>Unprivileged write to this bit is ignored if PRIV25 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 25, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 25, belonging to super-block 26.
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 25, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 25, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC26</name>
              <description>Unprivileged write to this bit is ignored if PRIV26 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 26, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 26, belonging to super-block 26.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 26, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 26, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC27</name>
              <description>Unprivileged write to this bit is ignored if PRIV27 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 27, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 27, belonging to super-block 26.
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 27, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 27, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC28</name>
              <description>Unprivileged write to this bit is ignored if PRIV28 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 28, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 28, belonging to super-block 26.
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 28, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 28, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC29</name>
              <description>Unprivileged write to this bit is ignored if PRIV29 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 29, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 29, belonging to super-block 26.
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 29, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 29, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC30</name>
              <description>Unprivileged write to this bit is ignored if PRIV30 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 30, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 30, belonging to super-block 26.
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 30, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 30, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC31</name>
              <description>Unprivileged write to this bit is ignored if PRIV31 bit is set in GTZC1_MPCBB1_PRIVCFGR26.
Writes are ignored if SPLCK26 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Non-secure access only to block 31, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.
1: Secure access only to block 31, belonging to super-block 26.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Non-secure access only to block 31, belonging to super-block 26. Secure access is also allowed if the SRWILADIS bit is set in GTZC1_MPCBBz_CR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Secure access only to block 31, belonging to super-block 26.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
