zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>GTZC1_MPCBB1_PRIVCFGR29</name>
          <displayName>GTZC1_MPCBB1_PRIVCFGR29</displayName>
          <description>GTZC1 SRAM1 MPCBB privileged configuration for super-block 29 register</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIV0</name>
              <description>Non-secure write to this bit is ignored if SEC0 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 0, belonging to super-block 29
1: Only privileged access to block 0, belonging to super-block 29
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 0, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 0, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV1</name>
              <description>Non-secure write to this bit is ignored if SEC1 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 1, belonging to super-block 29
1: Only privileged access to block 1, belonging to super-block 29
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 1, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 1, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV2</name>
              <description>Non-secure write to this bit is ignored if SEC2 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 2, belonging to super-block 29
1: Only privileged access to block 2, belonging to super-block 29
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 2, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 2, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV3</name>
              <description>Non-secure write to this bit is ignored if SEC3 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 3, belonging to super-block 29
1: Only privileged access to block 3, belonging to super-block 29
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 3, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 3, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV4</name>
              <description>Non-secure write to this bit is ignored if SEC4 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 4, belonging to super-block 29
1: Only privileged access to block 4, belonging to super-block 29
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 4, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 4, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV5</name>
              <description>Non-secure write to this bit is ignored if SEC5 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 5, belonging to super-block 29
1: Only privileged access to block 5, belonging to super-block 29
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 5, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 5, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV6</name>
              <description>Non-secure write to this bit is ignored if SEC6 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 6, belonging to super-block 29
1: Only privileged access to block 6, belonging to super-block 29
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 6, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 6, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV7</name>
              <description>Non-secure write to this bit is ignored if SEC7 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 7, belonging to super-block 29
1: Only privileged access to block 7, belonging to super-block 29
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 7, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 7, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV8</name>
              <description>Non-secure write to this bit is ignored if SEC8 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 8, belonging to super-block 29
1: Only privileged access to block 8, belonging to super-block 29
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 8, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 8, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV9</name>
              <description>Non-secure write to this bit is ignored if SEC9 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 9, belonging to super-block 29
1: Only privileged access to block 9, belonging to super-block 29
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 9, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 9, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV10</name>
              <description>Non-secure write to this bit is ignored if SEC10 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 10, belonging to super-block 29
1: Only privileged access to block 10, belonging to super-block 29
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 10, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 10, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV11</name>
              <description>Non-secure write to this bit is ignored if SEC11 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 11, belonging to super-block 29
1: Only privileged access to block 11, belonging to super-block 29
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 11, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 11, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV12</name>
              <description>Non-secure write to this bit is ignored if SEC12 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 12, belonging to super-block 29
1: Only privileged access to block 12, belonging to super-block 29
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 12, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 12, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV13</name>
              <description>Non-secure write to this bit is ignored if SEC13 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 13, belonging to super-block 29
1: Only privileged access to block 13, belonging to super-block 29
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 13, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 13, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV14</name>
              <description>Non-secure write to this bit is ignored if SEC14 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 14, belonging to super-block 29
1: Only privileged access to block 14, belonging to super-block 29
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 14, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 14, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV15</name>
              <description>Non-secure write to this bit is ignored if SEC15 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 15, belonging to super-block 29
1: Only privileged access to block 15, belonging to super-block 29
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 15, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 15, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV16</name>
              <description>Non-secure write to this bit is ignored if SEC16 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 16, belonging to super-block 29
1: Only privileged access to block 16, belonging to super-block 29
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 16, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 16, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV17</name>
              <description>Non-secure write to this bit is ignored if SEC17 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 17, belonging to super-block 29
1: Only privileged access to block 17, belonging to super-block 29
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 17, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 17, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV18</name>
              <description>Non-secure write to this bit is ignored if SEC18 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 18, belonging to super-block 29
1: Only privileged access to block 18, belonging to super-block 29
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 18, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 18, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV19</name>
              <description>Non-secure write to this bit is ignored if SEC19 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 19, belonging to super-block 29
1: Only privileged access to block 19, belonging to super-block 29
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 19, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 19, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV20</name>
              <description>Non-secure write to this bit is ignored if SEC20 bit is set in GTZC1_MPCBB1_SECCFGR29.
Writes are ignored if SPLCK29 bit is set in GTZC1_MPCBB1_CFGLOCKR1.
0: Privileged and unprivileged access to block 20, belonging to super-block 29
1: Only privileged access to block 20, belonging to super-block 29
</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 20, belonging to super-block 29</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 20, belonging to super-block 29</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV21</name>
              <description>Non-secure write to this bit is ignored if SEC21 bit is set in GTZC1_MPCBB1_SECCFGR29.
