zuyih/platform-ststm32/misc/svd/STM32U385.svd
1: Only privileged access to block 21, belonging to super-block 9
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 21, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 21, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV22</name>
              <description>Non-secure write to this bit is ignored if SEC22 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 22, belonging to super-block 9
1: Only privileged access to block 22, belonging to super-block 9
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 22, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 22, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV23</name>
              <description>Non-secure write to this bit is ignored if SEC23 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 23, belonging to super-block 9
1: Only privileged access to block 23, belonging to super-block 9
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 23, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 23, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV24</name>
              <description>Non-secure write to this bit is ignored if SEC24 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 24, belonging to super-block 9
1: Only privileged access to block 24, belonging to super-block 9
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 24, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 24, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV25</name>
              <description>Non-secure write to this bit is ignored if SEC25 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 25, belonging to super-block 9
1: Only privileged access to block 25, belonging to super-block 9
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 25, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 25, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV26</name>
              <description>Non-secure write to this bit is ignored if SEC26 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 26, belonging to super-block 9
1: Only privileged access to block 26, belonging to super-block 9
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 26, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 26, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV27</name>
              <description>Non-secure write to this bit is ignored if SEC27 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 27, belonging to super-block 9
1: Only privileged access to block 27, belonging to super-block 9
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 27, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 27, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV28</name>
              <description>Non-secure write to this bit is ignored if SEC28 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 28, belonging to super-block 9
1: Only privileged access to block 28, belonging to super-block 9
</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 28, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 28, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV29</name>
              <description>Non-secure write to this bit is ignored if SEC29 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 29, belonging to super-block 9
1: Only privileged access to block 29, belonging to super-block 9
</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 29, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 29, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV30</name>
              <description>Non-secure write to this bit is ignored if SEC30 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 30, belonging to super-block 9
1: Only privileged access to block 30, belonging to super-block 9
</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 30, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 30, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIV31</name>
              <description>Non-secure write to this bit is ignored if SEC31 bit is set in GTZC1_MPCBB2_SECCFGR9.
Writes are ignored if SPLCK9 bit is set in GTZC1_MPCBB2_CFGLOCKR1.
0: Privileged and unprivileged access to block 31, belonging to super-block 9
1: Only privileged access to block 31, belonging to super-block 9
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Privileged and unprivileged access to block 31, belonging to super-block 9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Only privileged access to block 31, belonging to super-block 9</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
