zuyih/platform-ststm32/misc/svd/STM32U385.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C1</name>
      <baseAddress>0x50005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>057</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>058</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C2</name>
      <baseAddress>0x50005800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <baseAddress>0x40042800</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>088</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>089</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>SEC_I2C3</name>
      <baseAddress>0x50042800</baseAddress>
    </peripheral>
    <peripheral>
      <name>I3C1</name>
      <description>I3C register block</description>
      <groupName>I3C</groupName>
      <baseAddress>0x40005C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I3C1_ER</name>
        <description>I3C1 error interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>I3C1_EV</name>
        <description>I3C1 event interrupt</description>
        <value>54</value>
      </interrupt>
      <registers>
        <register>
          <name>I3C_CR</name>
          <displayName>I3C_CR</displayName>
          <description>I3C message control register</description>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCNT</name>
              <description>Count of data to transfer during a read or write message, in bytes (whatever I3C acts as controller/target)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0000</name>
                  <description>no data to transfer</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0001</name>
                  <description>1 byte</description>
                  <value>0x0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0002</name>
                  <description>2 bytes</description>
                  <value>0x0002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xFFFF</name>
                  <description>64 Kbytes-1 byte</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNW</name>
              <description>Read / non-write message (when I3C acts as controller)
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>write message</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>read message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADD</name>
              <description>7-bit I3C dynamic / Iless thansup&gt;2less than/sup&gt;C static target address (when I3C acts as controller)
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTYPE</name>
              <description>Message type (whatever I3C acts as controller/target)
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>SCL clock is forced to stop until a next control word is executed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>header message</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>private message (refer to Figure585)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>direct message (second part of an I3C SDR direct CCC command) (refer to Figure578)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>legacy Iless thansup&gt;2less than/sup&gt;C message (refer to Figure587)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x8_WHEN_I3C_ACTS_AS_I3C_TARGET</name>
                  <description>hot-join request (W) (refer to Figure589)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x9_WHEN_I3C_ACTS_AS_I3C_TARGET</name>
                  <description>controller-role request (W) (refer to Figure590)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xA_WHEN_I3C_ACTS_AS_I3C_TARGET</name>
                  <description>IBI (in-band interrupt) request (R) (refer to Figure588)</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEND</name>
              <description>Message end type/last message of a frame (when the I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this message from controller is followed by a repeated start (Sr), before another message must be emitted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>this message from controller ends with a stop (P), being the last message of a frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I3C_CR_ALTERNATE1</name>
          <displayName>I3C_CR_ALTERNATE1</displayName>
          <description>I3C message control register</description>
          <alternateRegister>I3C_CR</alternateRegister>
          <addressOffset>0x000</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCNT</name>
              <description>Count of related data to the CCC command to transfer as CCC defining bytes, or CCC sub-command bytes, or CCC data bytes, in bytes
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0000</name>
                  <description>no data to transfer.</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0001</name>
                  <description>1 byte</description>
                  <value>0x0001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x0002</name>
                  <description>2 bytes</description>
                  <value>0x0002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xFFFF</name>
                  <description>64 Kbytes-1 byte</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCC</name>
              <description>8-bit CCC code (when I3C acts as controller)
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MTYPE</name>
              <description>Message type (when I3C acts as controller)
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x6_WHEN_I3C_ACTS_AS_I3C_CONTROLLER</name>
                  <description>broadcast/direct CCC command (refer to Table483, Figure578, Figure579, Figure580)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEND</name>
              <description>Message end type/last message of a frame (when I3C acts as controller)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>this message from controller is followed by a repeated start (Sr), before another message must be emitted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>the message from the controller ends with a stop (P), being the last message of a frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
