zuyih/platform-ststm32/misc/svd/STM32U385.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PKA">
      <name>SEC_PKA</name>
      <baseAddress>0x520C2000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>PWR Address block</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40030800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWR</name>
        <description>PWR non-secure interrupt</description>
        <value>123</value>
      </interrupt>
      <registers>
        <register>
          <name>PWR_CR1</name>
          <displayName>PWR_CR1</displayName>
          <description>PWR control register 1 </description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMS</name>
              <description>These bits select the low-power mode entered when the CPU enters the Deepsleep mode.
000: Stop 0 mode
001: Stop 1 mode
010: Stop 2 mode
011: Stop 3 mode
100-101: Standby mode
110-111: Shutdown mode
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Stop 0 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Stop 1 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>Stop 2 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Stop 3 mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x4</name>
                  <description>Standby mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x5</name>
                  <description>Standby mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x6</name>
                  <description>Shutdown mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x7</name>
                  <description>Shutdown mode</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB1</name>
              <description>This bit is used to keep the SRAM2 page 1 content in Standby mode. The SRAM2 page 1 corresponds to the first 8 Kbytes of the SRAM2 
(from SRAM2 base address to SRAM2 base address + 0x1FFF).
0: SRAM2 page1 content not retained in Standby mode
1: SRAM2 page1 content retained in Standby mode
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 page1 content not retained in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 page1 content retained in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB2</name>
              <description>This bit is used to keep the SRAM2 page 2 content in Standby mode. The SRAM2 page 2 corresponds to the 24 Kbytes of the SRAM2
(from SRAM2 base address + 0x2000 to SRAM2 base address + 0x7FFF).
0: SRAM2 page2 content not retained in Standby mode
1: SRAM2 page2 content retained in Standby mode
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 page2 content not retained in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 page2 content retained in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB3</name>
              <description>This bit is used to keep the SRAM2 page 3 content in Standby mode. The SRAM2 page 3 corresponds to the last 32 Kbytes of the SRAM2
(from SRAM2 base address + 0x8000 to SRAM2 base address + 0xFFFF).
0: SRAM2 page3 content not retained in Standby mode
1: SRAM2 page3 content retained in Standby mode
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 page3 content not retained in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 page3 content retained in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPMEN</name>
              <description>This bit is used to reduce the consumption by configuring the BOR in discontinuous mode.  This bit has effect only when the BOR level 0 is selected and when the device is in Standby mode. This bit must be set to reach the lowest power consumption in Standby mode.
0: BOR level 0 operating in continuous (normal) mode in Standby mode
1: BOR level 0 operating in discontinuous (ultra-low power) mode in Standby mode
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>BOR level 0 operating in continuous (normal) mode in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>BOR level 0 operating in discontinuous (ultra-low power) mode in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1PD</name>
              <description>This bit is used to reduce the consumption by powering off the SRAM1.
0: SRAM1 powered on
1: SRAM1 powered off
Note: When this bit is cleared to 0, wait for more than 1.6us before accessing the SRAM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM1 powered on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM1 powered off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2PD</name>
              <description>This bit is used to reduce the consumption by powering off the SRAM2.
0: SRAM2 powered on
1: SRAM2 powered off
Note: When this bit is cleared to 0, wait for more than 1.6us before accessing the SRAM.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 powered on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 powered off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
