zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>PWR_SVMSR</name>
          <displayName>PWR_SVMSR</displayName>
          <description>PWR supply voltage monitoring status register </description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REGS</name>
              <description>None
0: LDO selected
1: SMPS selected
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>LDO selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SMPS selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDO</name>
              <description>None
0: VDD is equal or above the PVD threshold selected by PVDLS[2:0].
1: VDD is below the PVD threshold selected by PVDLS[2:0]. 
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDD is equal or above the PVD threshold selected by PVDLS[2:0].</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDD is below the PVD threshold selected by PVDLS[2:0].</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDUSBRDY</name>
              <description>None
0: VDDUSB is below the threshold of the VDDUSB voltage monitor.
1: VDDUSB is equal or above the threshold of the VDDUSB voltage monitor.
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDUSB is below the threshold of the VDDUSB voltage monitor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDUSB is equal or above the threshold of the VDDUSB voltage monitor.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO2RDY</name>
              <description>None
0: VDDIO2 is below the threshold of the VDDIO2 voltage monitor.
1: VDDIO2 is equal or above the threshold of the VDDIO2 voltage monitor.
</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDIO2 is below the threshold of the VDDIO2 voltage monitor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDIO2 is equal or above the threshold of the VDDIO2 voltage monitor.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDA1RDY</name>
              <description>None
0: VDDA is below the threshold of the VDDA voltage monitor 1 (around 1.6V).
1: VDDA is equal or above the threshold of the VDDA voltage monitor 1 (around 1.6V).
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDA is below the threshold of the VDDA voltage monitor 1 (around 1.6V).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDA is equal or above the threshold of the VDDA voltage monitor 1 (around 1.6V).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDA2RDY</name>
              <description>None
0: VDDA is below the threshold of the VDDA voltage monitor 2 (around 1.8V).
1: VDDA is equal or above the threshold of the VDDA voltage monitor 2 (around 1.8V).
</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDA is below the threshold of the VDDA voltage monitor 2 (around 1.8V).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDA is equal or above the threshold of the VDDA voltage monitor 2 (around 1.8V).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_WUSR</name>
          <displayName>PWR_WUSR</displayName>
          <description>PWR wakeup status register </description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUF1</name>
              <description>This bit is set when a wakeup event is detected on WKUP1 line. This bit is cleared by writing 1 in the CWUF1 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN1=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF2</name>
              <description>This bit is set when a wakeup event is detected on WKUP2 line. This bit is cleared by writing 1 in the CWUF2 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN2=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF3</name>
              <description>This bit is set when a wakeup event is detected on WKUP3 line. This bit is cleared by writing 1 in the CWUF3 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN3=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF4</name>
              <description>This bit is set when a wakeup event is detected on WKUP4 line. This bit is cleared by writing 1 in the CWUF4 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN4=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF5</name>
              <description>This bit is set when a wakeup event is detected on WKUP5 line. This bit is cleared by writing 1 in the CWUF5 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN5=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF6</name>
              <description>This bit is set when a wakeup event is detected on WKUP6 line. This bit is cleared by writing 1 in the CWUF6 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN6=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF7</name>
              <description>This bit is set when a wakeup event is detected on WKUP7 line. This bit is cleared by writing 1 in the CWUF7 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN7=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF8</name>
              <description>This bit is set when a wakeup event is detected on WKUP8 line. This bit is cleared by writing 1 in the CWUF8 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN8=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF9</name>
              <description>This bit is set when a wakeup event is detected on WKUP9 line. This bit is cleared by writing 1 in the CWUF9 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN9=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF10</name>
              <description>This bit is set when a wakeup event is detected on WKUP10 line. This bit is cleared by writing 1 in the CWUF10 bit of PWR_WUSCR when WUSEL  different  11, or by hardware when WUPEN10=0. If WUSEL = 11, this bit is cleared by hardware when all internal wakeup source are cleared.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_WUSCR</name>
          <displayName>PWR_WUSCR</displayName>
          <description>PWR wakeup status clear register </description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWUF1</name>
              <description>Writing 1 to this bit clears the WUF1 flag in PWR_WUSR.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF2</name>
              <description>Writing 1 to this bit clears the WUF2 flag in PWR_WUSR.
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF3</name>
              <description>Writing 1 to this bit clears the WUF3 flag in PWR_WUSR.
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF4</name>
              <description>Writing 1 to this bit clears the WUF4 flag in PWR_WUSR.
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF5</name>
              <description>Writing 1 to this bit clears the WUF5 flag in PWR_WUSR.
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF6</name>
              <description>Writing 1 to this bit clears the WUF6 flag in PWR_WUSR.
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF7</name>
              <description>Writing 1 to this bit clears the WUF7 flag in PWR_WUSR.
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF8</name>
              <description>Writing 1 to this bit clears the WUF8 flag in PWR_WUSR.
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF9</name>
              <description>Writing 1 to this bit clears the WUF9 flag in PWR_WUSR.
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF10</name>
              <description>Writing 1 to this bit clears the WUF10 flag in PWR_WUSR.
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_APCR</name>
          <displayName>PWR_APCR</displayName>
          <description>PWR apply pull configuration register </description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC</name>
              <description>When this bit is set, the I/O pull-up and pull-down configurations defined in PWR_PUCRx and PWR_PDCRx are applied. When this bit is cleared, PWR_PUCRx and PWR_PDCRx are not applied to the I/Os.
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PUCRA</name>
          <displayName>PWR_PUCRA</displayName>
          <description>PWR port A pull-up control register </description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>When set, each bit activates the pull-up on PA0 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD0 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>When set, each bit activates the pull-up on PA1 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD1 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU2</name>
              <description>When set, each bit activates the pull-up on PA2 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD2 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>When set, each bit activates the pull-up on PA3 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD3 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU4</name>
              <description>When set, each bit activates the pull-up on PA4 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD4 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU5</name>
              <description>When set, each bit activates the pull-up on PA5 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD5 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU6</name>
              <description>When set, each bit activates the pull-up on PA6 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD6 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU7</name>
              <description>When set, each bit activates the pull-up on PA7 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD7 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU8</name>
              <description>When set, each bit activates the pull-up on PA8 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD8 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU9</name>
              <description>When set, each bit activates the pull-up on PA9 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD9 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU10</name>
              <description>When set, each bit activates the pull-up on PA10 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD10 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU11</name>
              <description>When set, each bit activates the pull-up on PA11 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD11 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU12</name>
              <description>When set, each bit activates the pull-up on PA12 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD12 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU13</name>
              <description>When set, each bit activates the pull-up on PA13 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD13 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU15</name>
              <description>When set, each bit activates the pull-up on PA15 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD15 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
