zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>PWR_PUCRC</name>
          <displayName>PWR_PUCRC</displayName>
          <description>PWR port C pull-up control register </description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PU0</name>
              <description>When set, each bit activates the pull-up on PC0 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD0 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU1</name>
              <description>When set, each bit activates the pull-up on PC1 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD1 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU2</name>
              <description>When set, each bit activates the pull-up on PC2 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD2 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU3</name>
              <description>When set, each bit activates the pull-up on PC3 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD3 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU4</name>
              <description>When set, each bit activates the pull-up on PC4 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD4 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU5</name>
              <description>When set, each bit activates the pull-up on PC5 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD5 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU6</name>
              <description>When set, each bit activates the pull-up on PC6 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD6 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU7</name>
              <description>When set, each bit activates the pull-up on PC7 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD7 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU8</name>
              <description>When set, each bit activates the pull-up on PC8 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD8 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU9</name>
              <description>When set, each bit activates the pull-up on PC9 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD9 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU10</name>
              <description>When set, each bit activates the pull-up on PC10 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD10 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU11</name>
              <description>When set, each bit activates the pull-up on PC11 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD11 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU12</name>
              <description>When set, each bit activates the pull-up on PC12 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD12 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU13</name>
              <description>When set, each bit activates the pull-up on PC13 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD13 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU14</name>
              <description>When set, each bit activates the pull-up on PC14 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD14 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PU15</name>
              <description>When set, each bit activates the pull-up on PC15 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD15 bit is also set.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PDCRC</name>
          <displayName>PWR_PDCRC</displayName>
          <description>PWR port C pull-down control register </description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD0</name>
              <description>When set, each bit activates the pull-down on PC0 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD1</name>
              <description>When set, each bit activates the pull-down on PC1 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD2</name>
              <description>When set, each bit activates the pull-down on PC2 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD3</name>
              <description>When set, each bit activates the pull-down on PC3 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD4</name>
              <description>When set, each bit activates the pull-down on PC4 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD5</name>
              <description>When set, each bit activates the pull-down on PC5 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD6</name>
              <description>When set, each bit activates the pull-down on PC6 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD7</name>
              <description>When set, each bit activates the pull-down on PC7 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD8</name>
              <description>When set, each bit activates the pull-down on PC8 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD9</name>
              <description>When set, each bit activates the pull-down on PC9 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD10</name>
              <description>When set, each bit activates the pull-down on PC10 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD11</name>
              <description>When set, each bit activates the pull-down on PC11 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD12</name>
              <description>When set, each bit activates the pull-down on PC12 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD13</name>
              <description>When set, each bit activates the pull-down on PC13 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD14</name>
              <description>When set, each bit activates the pull-down on PC14 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD15</name>
              <description>When set, each bit activates the pull-down on PC15 when the APC bit is set in PWR_APCR.
Note: The bit is reserved and must be kept to reset value when the corresponding I/O is not available on the selected package.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
