zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>SYSCFG_CFGR2</name>
          <displayName>SYSCFG_CFGR2</displayName>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLL</name>
              <description>Cortex-M33 LOCKUP (HardFault) output enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Cortex-M33 LOCKUP output disconnected from TIM1/15/16/17 break inputs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Cortex-M33 LOCKUP output connected to TIM1/15/16/17 break inputs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPL</name>
              <description>SRAM2 parity bit
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM double error disconnected from TIM1/15/16/17 break inputs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM double error connected to TIM1/15/16/17 break inputs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVDL</name>
              <description>PVD lock enable bit
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>PVD interrupt disconnected from TIM1/15/16/17 break input.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>PVD interrupt connected to TIM1/15/16/17 break input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECCL</name>
              <description>ECC lock
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>ECC double error disconnected from TIM1/15/16/17 break input</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>ECC double error connected to TIM1/15/16/17 break input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CCCSR</name>
          <displayName>SYSCFG_CCCSR</displayName>
          <description>SYSCFG compensation cell control/status register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN1</name>
              <description>VDD I/O compensation cell enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDD I/O compensation cell disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDD I/O compensation cell enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CS1</name>
              <description>VDD I/O code selection
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDD I/O code from the cell (available in the SYSCFG_CCVR)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDD I/O code from the SYSCFG compensation cell code register (SYSCFG_CCCR)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN2</name>
              <description>VDDIO2 I/O compensation cell enable
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDIO2 I/O compensation cell disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDIO2 I/O compensation cell enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CS2</name>
              <description>VDDIO2 I/O code selection
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDIO2 I/O code from the cell (available in SYSCFG_CCVR)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDIO2 I/O code from SYSCFG_CCCR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY1</name>
              <description>VDD I/O compensation cell ready flag
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDD I/O compensation cell not ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDD I/O compensation cell ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY2</name>
              <description>VDDIO2 I/O compensation cell ready flag
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>VDDIO2 I/O compensation cell not ready</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>VDDIO2 I/O compensation cell ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CCVR</name>
          <displayName>SYSCFG_CCVR</displayName>
          <description>SYSCFG compensation cell value register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCV1</name>
              <description>NMOS compensation value of the I/Os supplied by Vless thansub&gt;DDless than/sub&gt;
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCV1</name>
              <description>PMOS compensation value of the I/Os supplied by Vless thansub&gt;DDless than/sub&gt;
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NCV2</name>
              <description>NMOS compensation value of the I/Os supplied by Vless thansub&gt;DDIO2less than/sub&gt;
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCV2</name>
              <description>PMOS compensation value of the I/Os supplied by Vless thansub&gt;DDIO2less than/sub&gt;
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CCCR</name>
          <displayName>SYSCFG_CCCR</displayName>
          <description>SYSCFG compensation cell code register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00007878</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NCC1</name>
              <description>NMOS compensation code of the I/Os supplied by Vless thansub&gt;DDless than/sub&gt;
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCC1</name>
              <description>PMOS compensation code of the I/Os supplied by Vless thansub&gt;DDless than/sub&gt;
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCC2</name>
              <description>NMOS compensation code of the I/Os supplied by Vless thansub&gt;DDIO2less than/sub&gt;
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCC2</name>
              <description>PMOS compensation code of the I/Os supplied by Vless thansub&gt;DDIO2less than/sub&gt;
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_RSSCMDR</name>
          <displayName>SYSCFG_RSSCMDR</displayName>
          <description>SYSCFG RSS command register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSCMD</name>
              <description>RSS commands
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
