zuyih/platform-ststm32/misc/svd/STM32U385.svd
        <register>
          <name>USBSRAM_CHEP_TxRxBD_7</name>
          <displayName>USBSRAM_CHEP_TxRxBD_7</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEP7R register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TxRxBD_7_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_TxRxBD_7_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <alternateRegister>USBSRAM_CHEP_TxRxBD_7</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEP7R register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_7</name>
          <displayName>USBSRAM_CHEP_RxTxBD_7</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Tx</name>
              <description>These bits point to the starting address of the packet buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Tx</name>
              <description>These bits contain the number of bytes to be transmitted by the endpoint/channel associated with the USB_CHEPnR register at the next IN token addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RxTxBD_7_ALTERNATE</name>
          <displayName>USBSRAM_CHEP_RxTxBD_7_ALTERNATE</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <alternateRegister>USBSRAM_CHEP_RxTxBD_7</alternateRegister>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_Rx</name>
              <description>These bits point to the starting address of the packet buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_Rx</name>
              <description>These bits contain the number of bytes received by the endpoint/channel associated with the USB_CHEPnR register during the last OUT/SETUP transaction addressed to it.
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>These bits define the number of memory blocks allocated to this packet buffer. The actual amount of allocated memory depends on the BLSIZE value as illustrated in  less than xe7 []/&gt;.
</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>This bit selects the size of memory block used to define the allocated buffer area.
- If BLSIZE = 0, the memory block is 2-byte large, which is the minimum block allowed in a half-word wide memory. With this block size the allocated buffer size ranges from 2 to 62 bytes.
- If BLSIZE = 1, the memory block is 32-byte large, which permits to reach the maximum packet length defined by USB specifications. With this block size the allocated buffer size theoretically ranges from 32 to 1024 bytes, which is the longest packet size allowed by USB standard specifications. However, the applicable size is limited by the available buffer memory.
</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
